src/OpenFOAM/OpenFOAM-7/tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 292
);

regions
(
    boxToCell
    {
        box (0.002 -0.01 0.005) (0.02 0.01 0.055);
        fieldValues
        (
            volScalarFieldValue T 2200
        );
    }
);


// ************************************************************************* //
